Revit 2026 API

# LayoutRuleFixedDistanceSpacing Property

---

Get or set spacing of the Beam System.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public double Spacing { get; set; }
```
```vb
Public Property Spacing As Double
	Get
	Set
```
```cpp
public:
property double Spacing {
	double get ();
	void set (double value);
}
```
```fsharp
member Spacing : float with get, set
```

#### Property Value

Double

The value of spacing must be between 0 and 30000.

#### Reference

LayoutRuleFixedDistance Class

Autodesk.Revit.DB Namespace